codelingo/troubleshooting/tenets/misused-nil-interface.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-02 Fri 19:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>troubleshooting new tenet <code>misused-nil-interface</code></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shane" />
<link rel="stylesheet" type="text/css" href="https://mullikine.github.io/org-main.css"/>
<link rel="stylesheet" type="text/css" href="https://mullikine.github.io/magit.css"/>
</head>
<body>
<div id="content">
<h1 class="title">troubleshooting new tenet <code>misused-nil-interface</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4a1b247">1. Problem</a>
<ul>
<li><a href="#orgbcab58e">1.1. <code>example.go</code></a></li>
<li><a href="#orgbbf6589">1.2. This <code>codelingo.yaml</code> fails</a></li>
<li><a href="#org16fe22c">1.3. annotated <code>tty-output.log</code></a></li>
<li><a href="#org759d93c">1.4. repository info</a></li>
<li><a href="#org3510e62">1.5. https://github.com/codelingo/codelingo/blob/master</a></li>
<li><a href="#orgaef7966">1.6. git@github.com:mullikine/lingo.git/blob/master</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4a1b247" class="outline-2">
<h2 id="org4a1b247"><span class="section-number-2">1</span> Problem</h2>
<div class="outline-text-2" id="text-1">
<p>
Hitting lexicon error. Preventing me from running a review.
</p>
</div>

<div id="outline-container-orgbcab58e" class="outline-3">
<h3 id="orgbcab58e"><span class="section-number-3">1.1</span> <code>example.go</code></h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">./example.go</span>
<span style="color: #a1db00;">package</span> main

<span style="color: #a1db00;">import</span> <span style="color: #ff4ea3;">"fmt"</span>
<span style="color: #a1db00;">import</span> <span style="color: #ff4ea3;">"testing"</span>

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">Cat</span> <span style="color: #a1db00;">interface</span> {
      <span style="color: #ffd700;">Meow</span>()
}

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">Tabby</span> <span style="color: #a1db00;">struct</span>{}

<span style="color: #a1db00;">func</span> (*<span style="color: #00d7af;">Tabby</span>) <span style="color: #ffd700;">Meow</span>() { fmt.<span style="color: #ffd700;">Println</span>(<span style="color: #ff4ea3;">"meow"</span>) }

<span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">Must return something that is like 'Cat'. A 'Tabby' is like 'Cat' because it has a 'Meow' function</span>
<span style="color: #a1db00;">func</span> <span style="color: #ffd700;">GetACat</span>() <span style="color: #00d7af;">Cat</span> {
      <span style="color: #a1db00;">var</span> myTabby *Tabby = <span style="color: #5fafd7;">nil</span>
      <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">Oops, we forgot to set myTabby to a real value</span>
      <span style="color: #a1db00;">return</span> myTabby
}

<span style="color: #a1db00;">func</span> <span style="color: #ffd700;">TestGetACat</span>(t *<span style="color: #00d7af;">testing.T</span>) {
      <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">This test does not do what was intended. It's never nil because it's a pointer to a pointer</span>
      <span style="color: #a1db00;">if</span> <span style="color: #ffd700;">GetACat</span>() == <span style="color: #5fafd7;">nil</span> {
              t.<span style="color: #ffd700;">Errorf</span>(<span style="color: #ff4ea3;">"Forgot to return a real cat!"</span>)
      }
}

<span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">I am only testing the above circumstances, precisely, for the the moment</span>

<span style="color: #a1db00;">func</span> <span style="color: #ffd700;">main</span>() {
}

<span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">Heuristic:</span>
<span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;</span>
<span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">look for 'varname == nil' test where varname is a pointer (of type interface pointer?) to a pointer to nil.</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbf6589" class="outline-3">
<h3 id="orgbbf6589"><span class="section-number-3">1.2</span> This <code>codelingo.yaml</code> fails</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #ff8700;">funcs</span>:
  - <span style="color: #ff8700;">name</span>: newConcat
    <span style="color: #ff8700;">type</span>: resolver
    <span style="color: #ff8700;">body</span>: |
      <span style="color: #ff4ea3;">function (a, b) {</span>
<span style="color: #ff4ea3;">        return a.concat(b);</span>
<span style="color: #ff4ea3;">      }</span>
tenets:
  - <span style="color: #ff8700;">name</span>: misused-nil-interface
    <span style="color: #ff8700;">flows</span>:
      <span style="color: #ff8700;">codelingo/docs</span>:
        <span style="color: #ff8700;">title</span>: Misused Nil Interface
        <span style="color: #ff8700;">body</span>: |
          <span style="color: #ff4ea3;">Nil interface is not the same as having a nil pointer in the interface.</span>
      <span style="color: #ff8700;">codelingo/review</span>:
        <span style="color: #ff8700;">comment</span>: The variable being tested for nil, `{{varname}}` is a pointer to a pointer to nil.
    <span style="color: #ff8700;">query</span>: |
      <span style="color: #ff4ea3;">import codelingo/ast/go</span>

<span style="color: #ff4ea3;">      go.file(depth = any):</span>
<span style="color: #ff4ea3;">        go.decls:</span>
<span style="color: #ff4ea3;">          go.gen_decl:</span>
<span style="color: #ff4ea3;">            go.type_spec:</span>
              <span style="color: #ff8700;">go.ident</span>: <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">cat</span>
<span style="color: #ff4ea3;">                type as interfacetype</span>
<span style="color: #ff4ea3;">              go.interface_type:</span>
<span style="color: #ff4ea3;">                go.field_list:</span>
<span style="color: #ff4ea3;">                  go.field:</span>
<span style="color: #ff4ea3;">                    go.names:</span>
                      <span style="color: #ff8700;">go.ident</span>: <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">meow</span>
<span style="color: #ff4ea3;">                        name as purevirtualfuncname</span>
                        type == <span style="color: #ff4ea3;">"func()"</span>
<span style="color: #ff4ea3;">          go.gen_decl:</span>
<span style="color: #ff4ea3;">            go.type_spec:</span>
<span style="color: #ff4ea3;">              go.ident:</span>
<span style="color: #ff4ea3;">                type as typename</span>
<span style="color: #ff4ea3;">              go.struct_type</span>
          <span style="color: #ff8700;">go.func_decl</span>: <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">meow of tabby</span>
<span style="color: #ff4ea3;">            go.field_list:</span>
<span style="color: #ff4ea3;">              go.field:</span>
<span style="color: #ff4ea3;">                go.star_expr:</span>
                  <span style="color: #ff8700;">go.ident</span>: <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">tabby</span>
<span style="color: #ff4ea3;">                    type == typename</span>
            <span style="color: #ff8700;">go.ident</span>: <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">meow</span>
<span style="color: #ff4ea3;">              name == purevirtualfuncname</span>
<span style="color: #ff4ea3;">            go.func_type</span>
<span style="color: #ff4ea3;">          go.func_decl:</span>
            <span style="color: #ff8700;">go.ident</span>: <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">getacat</span>
<span style="color: #ff4ea3;">              name as factoryfuncname</span>
<span style="color: #ff4ea3;">            go.func_type:</span>
<span style="color: #ff4ea3;">              go.field_list</span>
              <span style="color: #ff8700;">go.field_list</span>: <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">the 2nd field list specifies the return parameters. this is an important distinction here but without an 'order:' fact, clql does not know this</span>
<span style="color: #ff4ea3;">                go.field:</span>
<span style="color: #ff4ea3;">                  go.ident:</span>
<span style="color: #ff4ea3;">                    type == interfacetype</span>
<span style="color: #ff4ea3;">            go.block_stmt:</span>
<span style="color: #ff4ea3;">              go.list:</span>
<span style="color: #ff4ea3;">                go.decl_stmt:</span>
<span style="color: #ff4ea3;">                  go.gen_decl:</span>
<span style="color: #ff4ea3;">                    go.value_spec:</span>
<span style="color: #ff4ea3;">                      go.names:</span>
<span style="color: #ff4ea3;">                        go.ident:</span>
                          type == newConcat(<span style="color: #ff4ea3;">"*/"</span>, typename)
<span style="color: #ff4ea3;">                      go.star_expr:</span>
<span style="color: #ff4ea3;">                        go.ident:</span>
<span style="color: #ff4ea3;">                          type == typename</span>
<span style="color: #ff4ea3;">                      go.values:</span>
<span style="color: #ff4ea3;">                        go.ident:</span>
                          name == <span style="color: #ff4ea3;">"nil"</span> <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">important. set pointer to pointer to nil</span>
<span style="color: #ff4ea3;">                go.return_stmt:</span>
<span style="color: #ff4ea3;">                  go.results:</span>
<span style="color: #ff4ea3;">                    go.ident:</span>
                      type == newConcat(<span style="color: #ff4ea3;">"*/"</span>, typename)
          <span style="color: #ff8700;">go.func_decl</span>: <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">TestGetACat</span>
<span style="color: #ff4ea3;">            go.block_stmt:</span>
<span style="color: #ff4ea3;">              go.binary_expr(depth = 2):</span>
<span style="color: #ff4ea3;">                go.call_expr:</span>
<span style="color: #ff4ea3;">                  go.ident:</span>
<span style="color: #ff4ea3;">                    name == factoryfuncname</span>
<span style="color: #ff4ea3;">                @review comment</span>
<span style="color: #ff4ea3;">                go.ident:</span>
                  name == <span style="color: #ff4ea3;">"nil"</span> <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">important. test is equal to nil</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org16fe22c" class="outline-3">
<h3 id="org16fe22c"><span class="section-number-3">1.3</span> annotated <code>tty-output.log</code></h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-text">Constructing new git repo in temp folder... :: Thu Nov  1 14:45:49 NZDT 2018
&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;
Running: $HOME/scripts/rs -nc
        -nogit
        -noswap
        $HOME/source/git/mullikine/codelingo/tenets/codelingo/k8/misused-nil-interface/
        /tmp/td_misused-nil-interfaceOlr89C
/usr/bin/rsync  -a -rtlhx -pug -s  --inplace --append   --exclude .cache  --exclude .git/ --exclude .gitignore --exclude TODO  --exclude '*~' --exclude '.#*'  $HOME/source/git/mullikine/codelingo/tenets/codelingo/k8/misused-nil-interface/ /tmp/td_misused-nil-interfaceOlr89C
&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;
/tmp/td_misused-nil-interfaceOlr89C
working_dir (initial): /tmp/td_misused-nil-interfaceOlr89C
Syncing your repo...
Running review flow...
Sorry, an <span style="color: #ffff00; background-color: #cccc00;">error</span> occurred while processing your request. Please try again.
&lt;Check slack <span style="color: #ffff00; background-color: #cccc00;">error</span>&gt;
exit status 1
review finished
Reformulate?
working_dir (loop): /tmp/td_misused-nil-interfaceOlr89C
: B
working_dir: /tmp/td_misused-nil-interfaceOlr89C
Continue?
</pre>
</div>
</div>
</div>

<div id="outline-container-org759d93c" class="outline-3">
<h3 id="org759d93c"><span class="section-number-3">1.4</span> repository info</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">tenet source</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://github.com/mullikine/tenets/blob/master/blog/misused-nil-interface">tenets/blog/misused-nil-interface at master  mullikine/tenets  GitHub</a></td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">org</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://github.com/mullikine/mullikine.github.io/blob/master/codelingo/troubleshooting/tenets/misused-nil-interface.org">github.com/mullikine/mullikine.github.io/blob/master/codelingo/troubleshooting/tenets/misused-nil-interface.org</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3510e62" class="outline-3">
<h3 id="org3510e62"><span class="section-number-3">1.5</span> <a href="https://github.com/codelingo/codelingo/blob/master">https://github.com/codelingo/codelingo/blob/master</a></h3>
<div class="outline-text-3" id="text-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">command</th>
<th scope="col" class="org-left">value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">cat /etc/issue</td>
<td class="org-left">Ubuntu 16.04.4 LTS \n \l</td>
</tr>

<tr>
<td class="org-left">vc url</td>
<td class="org-left"><a href="https://github.com/codelingo/codelingo">https://github.com/codelingo/codelingo</a></td>
</tr>

<tr>
<td class="org-left">vc get-hash</td>
<td class="org-left">eae3300ad7c32994725f90344f7cc25edfee6eca</td>
</tr>

<tr>
<td class="org-left">vc branch</td>
<td class="org-left">master</td>
</tr>

<tr>
<td class="org-left">go version</td>
<td class="org-left">go version go1.11.1 linux/amd64</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-text">commit eae3300ad7c32994725f90344f7cc25edfee6eca
Author: Jesse Meek <a href="mailto:waigani%40gmail.com">&lt;waigani@gmail.com&gt;</a>
Date:   Sat Oct 27 10:37:36 2018 +1300

    Disable test Tenet until mem spike is fixed.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaef7966" class="outline-3">
<h3 id="orgaef7966"><span class="section-number-3">1.6</span> git@github.com:mullikine/lingo.git/blob/master</h3>
<div class="outline-text-3" id="text-1-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">command</th>
<th scope="col" class="org-left">value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">cat /etc/issue</td>
<td class="org-left">Ubuntu 16.04.4 LTS \n \l</td>
</tr>

<tr>
<td class="org-left">vc url</td>
<td class="org-left">git@github.com:mullikine/lingo.git</td>
</tr>

<tr>
<td class="org-left">vc get-hash</td>
<td class="org-left">fa9b4edd1dcad69f83892282d69877ab51f4e89c</td>
</tr>

<tr>
<td class="org-left">vc branch</td>
<td class="org-left">master</td>
</tr>

<tr>
<td class="org-left">go version</td>
<td class="org-left">go version go1.11.1 linux/amd64</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-text">commit fa9b4edd1dcad69f83892282d69877ab51f4e89c
Merge: f34abad d1910ac
Author: BlakeMScurr <a href="mailto:blake%40codelingo.io">&lt;blake@codelingo.io&gt;</a>
Date:   Wed Oct 17 17:45:51 2018 +1300

    Merge pull request #424 from BlakeMScurr/docs-update
    
    Update doc fields.
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: shane</p>
<p class="date">Created: 2018-11-02 Fri 19:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>